Revit 2026 API

# LoadCombinationType Enumeration

---

Specifies load combination type.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LoadCombinationType
```
```vb
Public Enumeration LoadCombinationType
```
```cpp
public enum class LoadCombinationType
```
```fsharp
type LoadCombinationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Combination | 0 | Combination |
| Envelope | 1 | Envelope |

#### Reference

Autodesk.Revit.DB.Structure Namespace